of_cases/rhvt_3d_example/0/T
FoamFile { format ascii; class volScalarField; object T; }
dimensions      [ 0 0 0 1 0 0 0 ];
internalField   uniform 300;
boundaryField
{
    inlet    { type fixedValue;   value uniform 300; }
    coldEnd  { type zeroGradient; }
    hotEnd   { type zeroGradient; }
    wall     { type zeroGradient; }
}
