of_cases/rhvt_3d_example/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  OpenFOAM blockMeshDict — 3D Ranque-Hilsch Vortex Tube 示例
  O-grid 5块圆柱网格
  几何参数：
    D   = 20 mm  (管内径)
    L   = 200 mm (管长，L/D = 10)
    r_c = 5 mm   (冷端孔径，r_c/R = 0.5)
    a   = r_c/√2 = 3.536 mm  (内方格半宽)
    R2  = R/√2   = 7.071 mm  (外顶点投影半径)
  网格：n_c=8, n_r=10, n_z=60 → ~23k cells（粗网格，用于快速验证）
  参考：
    REF1 Prajit/FOSSEE OpenFOAM 3D Vortex Tube Case Study
    REF2 Burazer et al. Thermal Science 2017
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

scale   1;

vertices
(
    // z = 0 面（冷端/入口侧）
    (  0.003536 -0.003536  0 )  // 0 inner SE
    (  0.003536  0.003536  0 )  // 1 inner NE
    ( -0.003536  0.003536  0 )  // 2 inner NW
    ( -0.003536 -0.003536  0 )  // 3 inner SW
    (  0.007071 -0.007071  0 )  // 4 outer SE
    (  0.007071  0.007071  0 )  // 5 outer NE
    ( -0.007071  0.007071  0 )  // 6 outer NW
    ( -0.007071 -0.007071  0 )  // 7 outer SW
    // z = L 面（热端侧）
    (  0.003536 -0.003536  0.200 )  // 8
    (  0.003536  0.003536  0.200 )  // 9
    ( -0.003536  0.003536  0.200 )  // 10
    ( -0.003536 -0.003536  0.200 )  // 11
    (  0.007071 -0.007071  0.200 )  // 12
    (  0.007071  0.007071  0.200 )  // 13
    ( -0.007071  0.007071  0.200 )  // 14
    ( -0.007071 -0.007071  0.200 )  // 15
);

blocks
(
    // 中心方格
    hex (0 1 2 3  8 9 10 11)   ( 8  8 60 ) simpleGrading (1 1 1)
    // SE 外块：周向8格，径向10格（向壁面4:1加密）
    hex (4 5 1 0  12 13 9 8)   ( 8 10 60 ) simpleGrading (1 4 1)
    // NE 外块
    hex (5 6 2 1  13 14 10 9)  ( 8 10 60 ) simpleGrading (1 4 1)
    // NW 外块
    hex (6 7 3 2  14 15 11 10) ( 8 10 60 ) simpleGrading (1 4 1)
    // SW 外块
    hex (7 4 0 3  15 12 8 11)  ( 8 10 60 ) simpleGrading (1 4 1)
);

edges
(
    // z = 0 弧（R = 0.010 m）
    arc 4 5  (  0.010  0.000  0 )
    arc 5 6  (  0.000  0.010  0 )
    arc 6 7  ( -0.010  0.000  0 )
    arc 7 4  (  0.000 -0.010  0 )
    // z = L 弧
    arc 12 13 (  0.010  0.000  0.200 )
    arc 13 14 (  0.000  0.010  0.200 )
    arc 14 15 ( -0.010  0.000  0.200 )
    arc 15 12 (  0.000 -0.010  0.200 )
);

boundary
(
    coldEnd
    {
        type patch;
        faces ( (0 3 2 1) );
    }

    inlet
    {
        type patch;
        faces
        (
            (0 4 5 1)
            (1 5 6 2)
            (2 6 7 3)
            (3 7 4 0)
        );
    }

    hotEnd
    {
        type patch;
        faces
        (
            (8 9 10 11)
            (8 12 13 9)
            (9 13 14 10)
            (10 14 15 11)
            (11 15 12 8)
        );
    }

    wall
    {
        type wall;
        faces
        (
            (4 5 13 12)
            (5 6 14 13)
            (6 7 15 14)
            (7 4 12 15)
        );
    }
);

mergePatchPairs ();
