of_cases/rhvt_3d_example/system/decomposeParDict
FoamFile
{
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}

numberOfSubdomains  4;
method          scotch;
